<!-- eslint-disable no-undef -->

<script setup>
    import { useRouter } from 'vue-router'
    import utils from "@/scripts/utils.min.js"
    import { Menu } from '@element-plus/icons-vue'
    import StaticMusicCard from "@/model/StaticMusicCard.vue"

    const router = useRouter();
    const Cookies = utils.Cookies;
    const siteConfig = utils.siteConfig;
    const ReomEchoStore = utils.useReomEchoStore();
    const PostsEchoStore = utils.usePostsEchoStore();

    const toggleTheme = async () => {
        const profile = document.querySelector(".main-layout");
        if (profile.getAttribute('data-theme') !== "dark") {
            profile.setAttribute("data-theme","dark");
            Cookies.set('darkTheme', true ,{ expires: 30 });
            await ReomEchoStore.setDarksThemeStatus(true);
        } else {
            profile.setAttribute("data-theme","default");
            Cookies.set('darkTheme', false ,{ expires: 30 });
            await ReomEchoStore.setDarksThemeStatus(false);
        }
    }

    const toggleResize = async () => {
        const profile = document.querySelector(".main-layout");
        if (profile.getAttribute('data-resize') !== "True") {
            profile.setAttribute("data-resize","True");
            Cookies.set('resize', true ,{ expires: 30 });
            await ReomEchoStore.setPageResizeStatus(true);
        } else {
            profile.setAttribute("data-resize","False");
            Cookies.set('resize', false ,{ expires: 30 });
            await ReomEchoStore.setPageResizeStatus(false);
        }
    }
    
    const randomGetwayPost = async () => {
        if (siteConfig.actives.length === 1) return await ElMessage({type: 'warning', message: "当前只有一篇文章哦！"});
        let newPath;ReomEchoStore.setIsSiLodingStatus(true);
        do {
            const lenround = randomPost();
            newPath = siteConfig.actives[lenround].config.path;
            if (newPath != PostsEchoStore.thisPath) {
                router.push(`/docs/${newPath}`).then(() => {
                    document.querySelector('#Reomecho').scrollTo(0, 0);
                }).catch(async () => {
                    await ElMessage({type: 'error', message: "系统功能异常！"});
                });
            }
        } while (newPath == PostsEchoStore.thisPath);
    };
    const randomPost = () => { const lengths = siteConfig.actives.length - 1; return utils.getRandomIntInclusiveInter(0, lengths) };
</script>

<template>
    <span class="title-span">
        <a class="span-link" href="/">{{ siteConfig.global.site_title }}</a>
    </span>

    <el-button class="mobile-left-button mobile-button" :icon="Menu" @click="ReomEchoStore.setMobileDrawerStat(true)" v-if="ReomEchoStore.isDeviceMobilePhone && siteConfig.drawer.drawer_show"/>

    <span class="right-span">
        <span class="button-group">
            <el-tooltip content="切换主题" placement="bottom" effect="light" v-if="siteConfig.widget.theme_widget">
                <t-button variant="text" @click="toggleTheme" aria-label="切换主题">
                    <svg t="1719290618206" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7855" width="18" height="18"><path d="M411.308373 114.801778c-43.804444 11.036444-85.390222 29.468444-123.050666 54.442666a417.393778 417.393778 0 0 0-97.962667 89.144889 406.357333 406.357333 0 0 0-64.398222 117.361778A403.683556 403.683556 0 0 0 102.515484 512c0 55.466667 10.808889 108.373333 32.426667 158.833778 21.617778 50.631111 50.744889 94.208 87.381333 130.844444a410.965333 410.965333 0 0 0 130.730667 87.324445c50.517333 21.617778 103.537778 32.426667 159.004445 32.426666 46.933333 0 92.330667-7.68 136.192-23.324444a403.683556 403.683556 0 0 0 117.418666-64.398222 418.759111 418.759111 0 0 0 89.144889-97.962667 400.668444 400.668444 0 0 0 54.442667-122.88c-11.434667 0.967111-24.462222 1.536-38.798222 1.536a449.308444 449.308444 0 0 1-178.744889-36.522667 467.285333 467.285333 0 0 1-146.944-98.417777 465.92 465.92 0 0 1-98.417778-147.057778A448.056889 448.056889 0 0 1 409.658596 153.6c0-14.336 0.568889-27.306667 1.592888-38.684444v-0.113778zM512.001707 0c11.548444 0 22.869333 0.455111 34.019555 1.308444A357.660444 357.660444 0 0 0 540.446151 292.864c18.944 44.202667 44.373333 82.318222 76.458667 114.346667a359.537778 359.537778 0 0 0 114.346666 76.344889A350.435556 350.435556 0 0 0 870.401707 512c52.792889 0 103.651556-11.377778 152.405333-34.019556a508.017778 508.017778 0 0 1-17.180444 169.984 509.44 509.44 0 0 1-51.427556 122.595556 510.862222 510.862222 0 0 1-80.213333 103.424 516.380444 516.380444 0 0 1-103.367111 80.213333 513.592889 513.592889 0 0 1-394.638223 51.427556 513.592889 513.592889 0 0 1-122.595555-51.427556 518.371556 518.371556 0 0 1-103.424-80.213333 511.089778 511.089778 0 0 1-80.156445-103.424 509.155556 509.155556 0 0 1-51.427555-122.595556A508.074667 508.074667 0 0 1 0.001707 512c0-46.364444 6.144-91.761778 18.375111-135.964444a508.928 508.928 0 0 1 51.427555-122.595556 511.317333 511.317333 0 0 1 80.213334-103.424 508.017778 508.017778 0 0 1 103.367111-80.213333A508.302222 508.302222 0 0 1 376.037262 18.375111 508.472889 508.472889 0 0 1 512.001707 0z" fill="#666666" p-id="7856"></path></svg>
                </t-button>
            </el-tooltip>

            <el-tooltip content="放大/缩小" placement="bottom" effect="light" v-if="siteConfig.widget.resize_widget">
                <t-button variant="text" @click="toggleResize" aria-label="放大/缩小">
                    <svg t="1719383452624" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="21164" width="20" height="20"><path d="M412.5013333 324.94933337L412.5013333 552.27733337c0 9.728 3.584 18.944 11.264 26.624 5.632 7.68 15.36 11.264 26.624 11.264l227.328 0c20.992 0 37.888-16.896 37.888-37.888s-16.896-37.888-37.888-37.888L541.0133333 514.38933337l267.26399999-267.264c15.36-15.36 15.35999999-37.888 1e-8-53.248s-37.888-15.35999999-53.24800001 0l-267.26399999 267.264 0-136.704c0-20.992-16.896-37.888-37.888-37.888s-37.376 17.408-37.376 38.4z" fill="#666666" p-id="21165"></path><path d="M834.56 0H189.44C85.504 0 0 85.504 0 189.44v389.12c0 11.264 9.216 20.48 20.48 20.48h34.816c11.264 0 20.48-9.216 20.48-20.48V189.44c0-62.464 51.2-113.664 113.664-113.664h645.12c62.464 0 113.664 51.2 113.664 113.664v645.12c0 62.464-51.2 113.664-113.664 113.664H445.44c-11.264 0-20.48 9.216-20.48 20.48v34.816c0 11.264 9.216 20.48 20.48 20.48h389.12c104.448 0 189.44-85.504 189.44-189.44V189.44c0-103.936-85.504-189.44-189.44-189.44z" fill="#666666" p-id="21166"></path><path d="M276.48 732.16c8.704 0 15.36 6.656 15.36 15.36v184.32c0 8.704-6.656 15.36-15.36 15.36H92.16c-8.704 0-15.36-6.656-15.36-15.36v-184.32c0-8.704 6.656-15.36 15.36-15.36h184.32m0-76.8H92.16c-50.688 0-92.16 41.472-92.16 92.16v184.32c0 50.688 41.472 92.16 92.16 92.16h184.32c50.688 0 92.16-41.472 92.16-92.16v-184.32c0-50.688-41.472-92.16-92.16-92.16z" fill="#666666" p-id="21167"></path></svg>
                </t-button>
            </el-tooltip>

            <t-popup trigger="hover" v-if="siteConfig.widget.music_widget">
                <t-button variant="text" aria-label="Music">
                    <svg t="1716686001525" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7089" width="22" height="22"><path d="M789.74509 0a57.904987 57.904987 0 1 0 57.904987 57.904987A57.904987 57.904987 0 0 0 789.74509 0z" fill="#666666" opacity="0.3" p-id="7090"></path><path d="M516.459795 731.604091a185.853685 185.853685 0 1 1 185.689648-185.689648A186.017722 186.017722 0 0 1 516.459795 731.604091z m0-289.524937a103.835289 103.835289 0 1 0 103.671252 103.835289A103.999326 103.999326 0 0 0 516.459795 442.899337z" fill="#666666" p-id="7091"></path><path d="M516.459795 1023.917654a478.167248 478.167248 0 1 1 0-956.170459 487.517345 487.517345 0 0 1 60.037466 3.772846 41.009198 41.009198 0 1 1-10.170281 82.018396 389.58738 389.58738 0 0 0-49.211038-3.116699 395.656741 395.656741 0 1 0 253.764917 91.860603 41.009198 41.009198 0 1 1 52.491773-62.826091 478.003211 478.003211 0 0 1-306.912837 844.461404z" fill="#666666" p-id="7092"></path><path d="M661.632356 586.923641a42.813603 42.813603 0 0 1-14.763312-2.788626 41.009198 41.009198 0 0 1-23.457261-52.983884l126.80044-330.042024a41.009198 41.009198 0 0 1 76.605182 29.526622L699.360818 560.677754a41.009198 41.009198 0 0 1-37.728462 26.245887z" fill="#666666" p-id="7093"></path></svg>
                </t-button>

                <template #content>
                    <StaticMusicCard :player="true" style="width: 240px"/>
                </template>
            </t-popup>

            <el-tooltip content="随机开往" placement="bottom" effect="light" v-if="siteConfig.widget.rando_widget">
                <t-button variant="text" @click="randomGetwayPost" aria-label="随机开往">
                    <svg t="1716700768657" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="48550" width="20" height="20"><path d="M575.98643 618.752613v255.945718H853.260958a63.98643 63.98643 0 0 1 0 127.972859H170.739042a63.98643 63.98643 0 0 1 0-127.972859h277.274528v-255.945718H384.027141a63.98643 63.98643 0 0 1 0-127.972859h255.945718a63.98643 63.98643 0 0 1 0 127.972859h-63.986429zM427.708543 72.137874a85.315239 85.315239 0 0 1 168.582914 0 445.814783 445.814783 0 0 1 232.441369 123.280521c174.896241 174.896241 174.896241 458.484096 0 633.422995a63.98643 63.98643 0 0 1-90.519469-90.519469 319.932148 319.932148 0 1 0-452.426714 0 63.98643 63.98643 0 1 1-90.519469 90.519469c-174.896241-174.896241-174.896241-458.569412 0-633.465653a445.814783 445.814783 0 0 1 232.484027-123.237863z" fill="#666666" p-id="48551"></path></svg>
                </t-button>
            </el-tooltip>

            <el-tooltip content="界面设置" placement="bottom" effect="light" v-if="siteConfig.widget.header_setting">
                <t-button variant="text" aria-label="界面设置">
                    <svg t="1719289355288" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2870" id="mx_n_1719289355289" width="24" height="24"><path d="M693.78048 186.91072c3.64544 0 7.04 1.96096 8.86272 5.11488L884.42368 506.88a10.26048 10.26048 0 0 1 0 10.23488l-181.77536 314.84928c-1.82272 3.15904-5.2224 5.12-8.86784 5.12H330.21952a10.2656 10.2656 0 0 1-8.86272-5.11488l-181.78048-314.8544a10.26048 10.26048 0 0 1 0-10.23488l181.77536-314.84928c1.82272-3.15904 5.2224-5.12 8.86784-5.12h363.56096m0-71.64416H330.21952a81.87904 81.87904 0 0 0-70.912 40.93952L77.53216 471.06048a81.8688 81.8688 0 0 0 0 81.87904l181.78048 314.8544a81.87904 81.87904 0 0 0 70.912 40.93952h363.56096a81.87904 81.87904 0 0 0 70.912-40.93952l181.78048-314.8544a81.8688 81.8688 0 0 0 0-81.87904l-181.78048-314.8544a81.8944 81.8944 0 0 0-70.91712-40.93952z" fill="#666666" p-id="2871"></path><path d="M512 419.88608c50.7904 0 92.11392 41.32352 92.11392 92.11392S562.7904 604.11392 512 604.11392 419.88608 562.7904 419.88608 512 461.2096 419.88608 512 419.88608m0-71.64416c-90.4448 0-163.75808 73.3184-163.75808 163.75808s73.3184 163.75808 163.75808 163.75808 163.75808-73.3184 163.75808-163.75808S602.4448 348.24192 512 348.24192z" fill="#666666" p-id="2872"></path></svg>
                </t-button>
            </el-tooltip>

            <el-tooltip content="搜索组件（Ctrl + K）" placement="bottom" effect="light" v-if="siteConfig.widget.search_widget">
                <t-button variant="text" @click="ReomEchoStore.setSearchDialogStat(true)" aria-label="搜索组件" >
                    <svg t="1704850894017" class="icons" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5493" width="20" height="20"><path d="M453.818182 23.272727C704.465455 23.272727 907.636364 226.443636 907.636364 477.090909c0 35.746909-4.142545 70.981818-12.264728 105.192727a46.545455 46.545455 0 0 1-90.577454-21.504c6.469818-27.182545 9.751273-55.202909 9.751273-83.688727C814.545455 277.876364 653.032727 116.363636 453.818182 116.363636 254.603636 116.363636 93.090909 277.876364 93.090909 477.090909 93.090909 676.305455 254.603636 837.818182 453.818182 837.818182c101.003636 0 195.211636-41.658182 262.981818-113.826909a46.545455 46.545455 0 0 1 63.650909-3.979637c2.978909 1.792 5.818182 3.956364 8.401455 6.446546l213.201454 205.684363a45.707636 45.707636 0 0 1 0.581818 65.233455l-0.581818 0.581818a46.545455 46.545455 0 0 1-65.233454 0.581818l-185.390546-178.827636A452.305455 452.305455 0 0 1 453.818182 930.909091C203.170909 930.909091 0 727.738182 0 477.090909S203.170909 23.272727 453.818182 23.272727z m76.613818 179.828364c86.714182 23.598545 147.2 76.078545 177.245091 154.973091a46.545455 46.545455 0 0 1-86.993455 33.140363c-19.176727-50.362182-55.994182-82.315636-114.688-98.280727a46.545455 46.545455 0 1 1 24.436364-89.832727z" fill="#666666" p-id="5494"></path></svg>
                </t-button>
            </el-tooltip>

            <el-tooltip content="用户中心" placement="bottom" effect="light" v-if="siteConfig.widget.users_widget">
                <t-button variant="text" @click="utils.openAdminPage" aria-label="用户中心">
                    <svg t="1704850554771" class="icons" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4253" width="20" height="20"><path d="M880.182 987.568H143.818C98.705 987.568 62 952.882 62 910.245V801.52c0-122.986 110.113-223.042 245.455-223.042h409.09C851.887 578.478 962 678.533 962 801.52v108.726c0 42.636-36.704 77.322-81.818 77.322z m-736.364-82.197l736.363 0.379V801.52c0-77.873-73.408-141.224-163.637-141.224h-409.09c-90.228 0-163.636 63.351-163.636 141.224v103.851zM511.67 547.796c-140.984 0-255.682-114.697-255.682-255.682 0-140.984 114.697-255.682 255.682-255.682 140.985 0 255.682 114.697 255.682 255.682 0.001 140.985-114.697 255.682-255.682 255.682z m0-429.546c-95.871 0-173.864 77.993-173.864 173.864S415.8 465.978 511.67 465.978s173.864-77.993 173.864-173.864S607.541 118.25 511.67 118.25z" fill="#666666" p-id="4254"></path></svg>
                </t-button>
            </el-tooltip>
        </span>
    </span>
</template>

<style>
    @import url("./assets/HeadLayout.css");
</style>